Repository: rkward-community/rk.FactorAnalysis
Catalog: inst/rkward/po/rkward__Factoranalysis_rkward.*.po
Languages: de

# NAME OF TRANSLATORS
source: Your names
de: m.eik michalke

# EMAIL OF TRANSLATORS
source: Your emails
de: meik.michalke@hhu.de

source: RKWard GUI to conduct principal component and factor analysis
de: RKWard GUI zur Durchführung von Hauptkomponenten- und Faktorenanalysen

source: Preview not available, because package psych is not installed or cannot be loaded.
de: Vorschau nicht möglich, weil das Paket psych nicht installiert oder nicht geladen ist.

source: Scree plot results
de: Scree-Plot-Ergebnisse

source: Select data.frame
de: Wähle data.frame

source: Data
de: Daten

source: Main title
de: Haupttitel

source: Draw scree for
de: Zeichne Scree-Plot für

source: Factors and components
de: Faktoren und Komponenten

source: Factors only
de: Nur Faktoren

source: Prinicipal components only
de: Nur Hauptkomponenten

source: Horizontal line
de: Horizontale Linie

source: Eigenvalue
de: Eigenwert

source: Preview
de: Vorschau

source: Correlation plot
de: Korrelationsplot

source: Select data
de: Wähle Daten

source: Data (correlation/factor matrix)
de: Daten (Korrelations-/Faktormatrix)

source: Colors
de: Farben

source: Red to Blue
de: Rot nach Blau

source: Greyscale
de: Graustufen

source: Range of correlation values to color
de: Bereich der einzufärbenden Korrealtionswerte

source: from
de: von

source: to
de: bis

source: Number of shades
de: Anzahl Farbtöne

source: Show legend
de: Legende

source: Number of categories in legend
de: Anzahl der Kategorien in Legende

source: Parallel analysis (Horn)
de: Parallelanalyse (Horn)

source: Parallel analysis (Horn) results
de: Ergebnisse der Parallelanalyse (Horn)

source: Parallel analysis
de: Parallelanalyse

source: Select data.frame/matrix
de: Wähle data.frame oder Matrix

source: Show Eigenvalues for
de: Zeige Eigenwerte für

source: Factoring method
de: Faktorisierungsmethode

source: Minimum residual (ULS)
de: Minimale Residuen (ULS)

source: Weighted least squares (WLS)
de: Gewichtete kleinste Quadrate (WLS)

source: Generalized weighted least squares (GLS)
de: Generalisierte gewichtete kleinste Quadrate (GLS)

source: Principal axis
de: Hauptachse

source: Number of observations (0 implies raw data)
de: Anzahl an Beobachtungen (0 impliziert Rohdaten)

source: Number of iterations
de: Anzahl an Iterationen

source: Estimate communalities by SMCs
de: Schätze Kommunalitäten der SMCs

source: Plot error bars
de: Zeichne Fehlerbalken

source: Save data to workspace
de: Speichere Ergebnisse im Workspace

source: Very Simple Structure/Minimum Average Partial results
de: Very Simple Structure/Minimum Average Partial Ergebnisse

source: VSS complexity 1 achieves a maximimum of
de: VSS Komplexität 1 erreicht ein Maximum von

source: with
de: mit

source: factors.
de: Faktoren.

source: VSS complexity 2 achieves a maximimum of
de: VSS Komplexität 2 erreicht ein Maximum von

source: The Velicer MAP criterion achieves a minimum of
de: Das Velicer-MAP-Kriterium erreicht ein Maximum von

source: Statistics
de: Statistiken

source: Principal component analysis
de: Hauptkomponentenanalyse

source: Principal axis factor analysis
de: Hauptachsen-Faktorenanalyse

source: Maximum likelihood factor analysis
de: Maximum-Likelihood-Faktorenanalyse

source: Number of observations
de: Anzahl an Beobachtungen

source: Rotation method
de: Rotationsmethode

source: None
de: keine

source: Fit the diagonal as well
de: Fitte auch die Diagonale

source: Plot results
de: Plotte Ergebnisse

source: Connect different complexities
de: Verbinde verschiedene Komplexitäten

source: Measure of Sampling Adequacy (Kaiser-Meyer-Olkin)
de: MSA-Koeffizienten (Kaiser-Meyer-Olkin)

# R code comment
source: Function to round values
de: Funktion zum Runden von Werten

# R code comment
source: Function to add some hints regarding interpretation
de: Funktion, um Hinweise zur Interpretation hinzuzufügen

source: unacceptable
de: inakzeptabel

source: marvelous
de: sehr gut

source: mertitourious
de: gut

source: middling
de: mittel

source: medicore
de: mäßig

source: miserable
de: schlecht

# R code comment
source: Nice format for output
de: Hübsches Format für die Ausgabe

source: Kaiser-Meyer-Olkin Factor Adequacy
de: Kaiser-Meyer-Olkin-Koeffizient

source: Overall Measure of Sampling Adequacy
de: Allgemeiner MSA-Koeffizient

source: Measure of Sampling Adequacy per Item
de: MSA-Koeffizienten per Item

source: Correlation matrix (or raw data matrix)
de: Korrelationsmatrix (oder Rohdatenmatrix)

source: Show decimals
de: Zeige Dezimalstellen

source: Save results to workspace
de: Speichere Ergebnisse im Workspace

source: Factor analysis
de: Faktorenanalyse

# R code comment
source: Make matrix from loadings, for more flexible output
de: Erzeuge Matrix aus Ladungen, für flexiblere Ausgabe

# R code comment
source: Nicen component names
de: Hübschere Komponentennamen

# R code comment
source: For printout, highlight loadings
de: Hebe Ladungen in der Ausgabe hervor

# R code comment
source: Append communality and uniqueness
de: Füge Kommunalität und Eindeutigkeit an

source: communality
de: Kommunalität

source: uniqueness
de: Eindeutigkeit

# R code comment
source: Append sum of squared loadings
de: Füge Quadratsummenladung an

# R code comment
source: Variance explained
de: Erklärte Varianz

source: Sum of squared loadings
de: Quadratsummenladung

source: Variance explained (%)
de: Erklärte Varianz (%)

source: Variance explained (cum %)
de: Erklärte Varianz (kumulierte %)

# R code comment
source: Finally, make it a data.frame
de: Erzeuge schließlich einen data.frame

# R code comment
source: Prepare correlation matrix for printout
de: Bereite Korrelationsmatrix für Ausgabe auf

# R code comment
source: Prepare score*factors matrix for printout
de: Bereite Score*Faktoren-Matrix für Ausgabe auf

source: Correlation of scores with factors
de: Korrelation zwischen Score und Faktoren

source: Multiple R square of scores with factors
de: Multiples R-Quadtrat (Score * Faktoren)

source: Minimum correlation of possible factor scores
de: Minimale Korrelation möglicher Faktorscores

# R code comment
source: Ok, here the actual output starts
de: Ok, hier beginnt die eigentliche Ausgabe

source: Principal Component Analysis
de: Hauptkomponentenanalyse

source: Factor Analysis
de: Faktorenanalyse

source: Number of components
de: Anzahl der Komponenten

source: Number of factors
de: Anzahl der Faktoren

source: Normalization
de: Normalisieren

source: Degrees of freedom
de: Freiheitsgrade

source: Loadings
de: Ladungen

source: Factor correlations
de: Faktorkorrelationen

source: Measures of factor score adequacy
de: Maße der Faktor-Score-Angemessenheit

source: Exploratory factor analysis
de: Exploratorische Faktorenanalyse

source: Correlation method
de: Korrelationsmethode

source: Pearson product-moment (numeric data)
de: Pearson Produkt-Moment (numerische Daten)

source: Polychoric (polytomous data)
de: Polychorisch (polytome Daten)

source: Number of factors to extract
de: Anzahl zu extrahierender Faktoren

source: Options
de: Optionen

source: none
de: keine

source: Initial communality estimate
de: Ausgangsschätzung der Kommunalität

source: Squared multiple correlations
de: Quadrierte multiple Korrelationen

source: Matrix to factor
de: Matrix zu Faktor

source: Factor correlation matrix
de: Faktorisiere Korrelationsmatrix

source: Factor covariance matrix
de: Faktorisiere Kovarianzmatrix

source: Matrix to score
de: Matrix zu Score

source: Scores based on structure matrix (oblique)
de: Scores basierend auf Strukturmatrix (oblique)

source: Scores based on pattern matrix
de: Scores basierend auf Mustermatrix

source: Show residuals
de: Zeige Residuen

source: Apply Kaiser normalization
de: Wende Kaiser-Normalisierung an

source: Find component scores
de: Finde Komponenten-Scores

source: Dealing with missing values
de: Umgang mit fehlenden Werten

source: Don't impute missing values
de: Fehlende Werte nicht auffüllen

source: Replace with median
de: Durch Median ersetzen

source: Replace with mean
de: Durch Mittelwert ersetzen

source: Method to find factor scores
de: Methode zur Bestimmung der Faktorscores

source: Simple regression (Thurstone)
de: Einfache Regression (Thurstone)

source: correlation preserving (ten Berge)
de: Korrelationserhaltend (ten Berge)

source: Number of observations to find the correlation matrix (GoF statistics)
de: Anzahl der Beobachtungen zur Bestimmung der Korrelationsmatrix (GoF-Statistiken)

source: Perform bootstrap iterations
de: Führe Bootsprap-Iterationen durch

source: Until change in communalities is less than
de: Bis die Änderung in den Kommunalitäten kleiner ist als

source: Maximum number of iterations
de: Maximale Anzahl an Interationen

source: Output
de: Ausgabe

source: Marker item threshold (cut-off)
de: Grenzwert für Markieritems (cut-off)

source: Analysis
de: Analyse
